app/Controllers/FrontProfil.php

    public function index()
    {

        $data = [
            'tampilProfile' => $this->profile->tampilData()->getResult(),
            'profilePager' => $this->profile->paginate(12, 'profile'),
---
SELECT *
FROM `mst_profile`
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `mst_profile`