app/Controllers/Home.php

    public function index()
    {

        $data['profilePager'] = $this->profile->paginate(12, 'profile');
---
SELECT *
FROM `mst_profile`
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `mst_profile`