app/Models/ProductModel.php

SELECT *
FROM `mst_produk`
---
    function tampilData()
    {
        return $this->db->table('mst_produk')->get();

SELECT *
FROM `mst_produk`
WHERE `id` = '14'
---
    function ambilData($id)
    {
        return $this->db->table('mst_produk')->getWhere(['id' => $id]);