app/Models/ProfileModel.php

    function tampilData()
    {
        return $this->db->table('mst_profile')->get();
---
SELECT *
FROM `mst_profile`

    function ambilData($id)
    {
        return $this->db->table('mst_profile')->getWhere(['id' => $id]);
---
SELECT *
FROM `mst_profile`
WHERE `id` = '74'